import {LOCALES} from '../locales';

const hy ={
    [LOCALES.ARMENIAN]:{
        title: `React Architecture. Ինչպես կառուցել և կազմակերպել React հավելվածը`,
        content: `React հավելվածը կազմակերպելու ճիշտ ձևի վերաբերյալ կոնսենսուս չկա: React-ը ձեզ մեծ ազատություն է տալիս, բայց այդ ազատության հետ մեկտեղ գալիս է ձեր սեփական ճարտարապետությունը որոշելու պատասխանատվությունը: Հաճախ պատահում է, որ ով սկզբում տեղադրում է հավելվածը, գրեթե ամեն ինչ գցում է թղթապանակի մեջ components, կամ գուցե componentsև containersեթե նրանք օգտագործել են Redux-ը, բայց ես առաջարկում եմ, որ ավելի լավ տարբերակ կա: Ես սիրում եմ մտածված լինել, թե ինչպես եմ կազմակերպում իմ հավելվածները, որպեսզի դրանք հեշտ օգտագործվեն, հասկանան և ընդլայնվեն:

        Ես պատրաստվում եմ ձեզ ցույց տալ, թե ինչ եմ համարում ինտուիտիվ և մասշտաբային համակարգ լայնածավալ արտադրության React հավելվածների համար: Կարծում եմ, որ հիմնական հայեցակարգը կարևոր է ճարտարապետությունը կենտրոնացնել հատկանիշի վրա ՝ ի տարբերություն տիպի , կազմակերպելով միայն ընդհանուր բաղադրիչները գլոբալ մակարդակում և մոդուլյարացնելով բոլոր մյուս առնչվող սուբյեկտները՝ տեղայնացված տեսքով:`
    }
}

export default hy   
